'use strict';

/*
Написать простой игровой бот, который умеет следующее:
  Загадывает число от 1 до 100;
  предлагает пользователю ввести свой вариант отгадки;
  если пользовательское число больше, чем загаданное, то бот выводит “Меньше!” и предлагает ввести новый вариант;
  если пользовательское число меньше, чем загаданное, то бот выводит “Больше!” и предлагает ввести новый вариант;
  если пользователь вводит правильное число, то бот выводит “Правильно!”;
  если пользователь ввел не число, то выводит “Введи число!”;
  если пользователь нажимает “Отмена”, то игра заканчивается.
*/

const botNumber = Math.ceil(Math.random()*100);
console.log('Я загадал число: ', botNumber);

const isNumber = (bot, user) => {
  if (bot > user) {
    alert(`Больше!`);
    getUserNumber();
  } else if (bot < user) {
    alert(`Меньше!`);
    getUserNumber();
  } else {
    alert(`Правильно! Игра окончена.`);
    return true;
  }
}

const getUserNumber = () => {
  let userNumber = prompt('Отгадай, какое число от 1 до 100 я загадал. Введи свой вариант:');
  
  if (userNumber === null) {
    alert('Уже уходите?! Жаль...');
    return;
  }

  if (!Number.isNaN(+userNumber)) {
    if (isNumber(botNumber, userNumber)) {
      return;
    };
  } else {
    alert('Введи число!');
    getUserNumber();
  }
}

getUserNumber();